Revit 2024 API
RoutingPreferenceRule.RemoveCriteron Method
 Removes an existing criterion.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void RemoveCriteron(
	int index
)
Visual Basic
Public Sub RemoveCriteron ( _
	index As Integer _
)
Visual C++
public:
void RemoveCriteron(
	int index
)
Parameters
index
Type: System.Int32
 The index position of removed routing preference rule in the group.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  index is not a valid zero-based index. -or- Thrown if the index is out of bounds.
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Mechanical Electrical Piping.
See Also
RoutingPreferenceRule Class
Autodesk.Revit.DB Namespace